#+TITLE:  Introduction to Literate Programming
#+AUTHOR: Howard Abrams
#+EMAIL:  howard.abrams@gmail.com
#+DATE:   2016 Feb 17
#+TAGS:   org-mode emacs presentation
#+STARTUP: inlineimages yes
#+PROPERTY: tangle no
#+PROPERTY: eval no-export
#+PROPERTY: results replace
#+PROPERTY: exports code

First of all, I would like to apologize for the examples.
I need code and scripts in various languages that are short, simple to
understand, not distracting, and useful.

I sometimes can get one of those features. I would love better ones.

** Language-Specific Default Values
   :PROPERTIES:
   :header-args:sh: :dir /etc
   :header-args:ruby: :dir /
   :END:

   You can specify [[info:org#Language-specific%20header%20arguments%20in%20Org%20mode%20properties][language-specific header arguments]]:
   - Type: ~C-c C-x p~
   - For =Property= enter: ~header-args:sh~
   - For =Value= enter: ~:dir /etc
   - Type: ~C-c C-x p~
   - For =Property= enter: ~header-args:ruby~
   - For =Value= enter: ~:dir /~

       #+BEGIN_SRC sh
         ls -d $(pwd)
       #+END_SRC

       #+RESULTS:
       : /etc

       #+BEGIN_SRC ruby
         File.absolute_path('.')
       #+END_SRC

       #+RESULTS:
       : /

   *Note:* Some parameters can only be set with =header-args=

** Results

   When you execute a block, what do you want out of it?
   - results of the expression?
   - outputted results?

       #+BEGIN_SRC ruby
         puts 'Hello World'
         5 * 6
       #+END_SRC

       #+RESULTS:
       : 30

   Change the [[info:org#Results%20of%20evaluation][:results]] header argument:

       #+BEGIN_SRC ruby :results output
         puts 'Hello World'
         5 * 6
       #+END_SRC

       #+RESULTS:
       : Hello World

   *Note:* Default for =sh= is =output=.

*** Lists

    Notice the previous output created a table. Let's make a list:

        #+BEGIN_SRC ruby :results list
          Dir.entries('.').sort.select do |file|
             file[0] != '.'
          end
        #+END_SRC

        #+RESULTS:
        - for-the-host.el
        - instructions.org
        - literate-programming-tangling.png
        - literate-programming-tangling2.png

   The Ruby code above is just an example. Use your favorite language
   to pull out a list of files from a directory.

*** Raw Output

    Shell commands and log output are candidates.

      #+BEGIN_SRC sh :results verbatim :exports both
        ssh -v goblin.howardabrams.com ls mossandcrow
      #+END_SRC

      #+RESULTS:
      OpenSSH_6.6.1, OpenSSL 1.0.1f 6 Jan 2014
      debug1: Reading configuration data /etc/ssh/ssh_config
      debug1: /etc/ssh/ssh_config line 19: Applying options for *
      debug1: Connecting to goblin.howardabrams.com [162.243.135.186] port 22.
      debug1: Connection established.
      debug1: identity file /home/howard/.ssh/id_rsa type 1
      debug1: identity file /home/howard/.ssh/id_rsa-cert type -1
      debug1: identity file /home/howard/.ssh/id_dsa type -1
      debug1: identity file /home/howard/.ssh/id_dsa-cert type -1
      debug1: identity file /home/howard/.ssh/id_ecdsa type -1
      debug1: identity file /home/howard/.ssh/id_ecdsa-cert type -1
      debug1: identity file /home/howard/.ssh/id_ed25519 type -1
      debug1: identity file /home/howard/.ssh/id_ed25519-cert type -1
      debug1: Enabling compatibility mode for protocol 2.0
      debug1: Local version string SSH-2.0-OpenSSH_6.6.1p1 Ubuntu-2ubuntu2.4
      debug1: Remote protocol version 2.0, remote software version OpenSSH_6.6.1p1 Ubuntu-2ubuntu2.6
      debug1: match: OpenSSH_6.6.1p1 Ubuntu-2ubuntu2.6 pat OpenSSH_6.6.1* compat 0x04000000
      debug1: SSH2_MSG_KEXINIT sent
      debug1: SSH2_MSG_KEXINIT received
      debug1: kex: server->client aes128-ctr hmac-md5-etm@openssh.com none
      debug1: kex: client->server aes128-ctr hmac-md5-etm@openssh.com none
      debug1: sending SSH2_MSG_KEX_ECDH_INIT
      debug1: expecting SSH2_MSG_KEX_ECDH_REPLY
      debug1: Server host key: ECDSA 33:a5:af:64:c4:0a:84:6a:a8:57:5a:5f:69:13:08:85
      debug1: Host 'goblin.howardabrams.com' is known and matches the ECDSA host key.
      debug1: Found key in /home/howard/.ssh/known_hosts:2
      debug1: ssh_ecdsa_verify: signature correct
      debug1: SSH2_MSG_NEWKEYS sent
      debug1: expecting SSH2_MSG_NEWKEYS
      debug1: SSH2_MSG_NEWKEYS received
      debug1: SSH2_MSG_SERVICE_REQUEST sent
      debug1: SSH2_MSG_SERVICE_ACCEPT received
      debug1: Authentications that can continue: publickey,password
      debug1: Next authentication method: publickey
      debug1: Offering RSA public key: /home/howard/.ssh/id_rsa
      debug1: Server accepts key: pkalg ssh-rsa blen 279
      debug1: key_parse_private2: missing begin marker
      debug1: read PEM private key done: type RSA
      debug1: Authentication succeeded (publickey).
      Authenticated to goblin.howardabrams.com ([162.243.135.186]:22).
      debug1: channel 0: new [client-session]
      debug1: Requesting no-more-sessions@openssh.com
      debug1: Entering interactive session.
      debug1: Sending environment.
      debug1: Sending env LANG = en_US.UTF-8
      debug1: Sending command: ls mossandcrow
      debug1: client_input_channel_req: channel 0 rtype exit-status reply 0
      debug1: client_input_channel_req: channel 0 rtype eow@openssh.com reply 0
      about.html
      contact.html
      examples.html
      img
      index.html
      scripts
      styles
      debug1: channel 0: free: client-session, nchannels 1
      debug1: fd 0 clearing O_NONBLOCK
      debug1: fd 1 clearing O_NONBLOCK
      Transferred: sent 3388, received 2616 bytes, in 0.6 seconds
      Bytes per second: sent 5588.8, received 4315.3
      debug1: Exit status 0

*** Restarting Example

    To prove that interpreters are restarted with each block:

        #+BEGIN_SRC python
          answer = 42
          return answer
        #+END_SRC

        #+RESULTS:
        : 42

        #+BEGIN_SRC python
          return answer / 2
        #+END_SRC

        #+RESULTS:
        NameError: global name 'avar' is not defined

*** Passing Consistency

    To prove that =:session=-based interpreters are /not/ restarted with
    each block:

        #+BEGIN_SRC ruby :session foobar
          avar = 42
        #+END_SRC

        #+RESULTS:
        : 42

        #+BEGIN_SRC ruby :session foobar
          avar / 2
        #+END_SRC

        #+RESULTS:
        : 21

    *Note:* The =:session= is good to set as a section property.

    Switch to the =*foobar*= buffer to interact with the interpreter.

    *Warning:* A named session can be shared across languages.

*** Warning about Shared Sessions

    What's wrong with the following?

        **** Confusing Stuff
        :PROPERTIES:
        :session:  stateful
        :END:

        #+BEGIN_SRC sh :results silent
          NUM_USERS=$(grep 'bash' /etc/passwd | wc -l --)
        #+END_SRC

        We have access to them:
        #+BEGIN_SRC sh
          echo $NUM_USERS
        #+END_SRC

        #+RESULTS:
        : 2

        #+BEGIN_SRC ruby
          21 * 2
        #+END_SRC

     *Warning:* A =:session= setting for a section is shared for each
              block... /regardless of language!/

** Variable Example

   Build this block and execute it with ~C-c C-c~:

       #+BEGIN_SRC python :var interest=13
         return 313 * (interest / 100.0)
       #+END_SRC

       #+RESULTS:
       : 40.69

   Pythonic precision for the win.

** Setting Variables

   Specify multiple values all over the place:

       #+HEADER: :var a=42 d=56 :var f=23
       #+HEADERS: :var b=79 e=79
       #+BEGIN_SRC ruby :var c=3 g=2
         [ a, b, c, d, e, f, g ]
       #+END_SRC

       #+RESULTS:
       | 42 | 79 | 3 | 56 | 79 | 23 | 2 |

   How useful is this?

   Allows you to verify a /block of code/ with values that are not
   tangled.

** Block-to-Block Value Passing

   First, name your block:

       #+NAME: twelve-primes
       #+BEGIN_SRC ruby
         require 'prime'
         Prime.first 12
       #+END_SRC

       #+RESULTS: twelve-primes
       | 2 | 3 | 5 | 7 | 11 | 13 | 17 | 19 | 23 | 29 | 31 | 37 |

   Pass them into another code block as an /array/ variable:

       #+BEGIN_SRC python :var primes=twelve-primes
         return primes[-1]
       #+END_SRC

   First time Ruby and Python has worked together.

** Calc

   Access the [[info:calc#Top][Emacs Calculator]] as well.
   You may need to load it: ~M-x load-library~ and type: ~ob-calc~

       #+BEGIN_SRC calc :var a=2 b=9 c=64 x=5
         ((a+b)^3 + sqrt(c)) / (2x+1)
       #+END_SRC

       #+RESULTS:
       : 121.727272727

   Or simplify the formula:

       #+BEGIN_SRC calc :var a=4 b=2
         ((a+b)^3 + sqrt(c)) / (2x+1)
       #+END_SRC

       #+RESULTS:
       : (sqrt(c) + 216) / (2 x + 1)

